systests/jaxws/src/test/java/org/apache/cxf/systest/provider/cxf4130data.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inb="http://cxf.apache.org/soapheader/inband">
   <soapenv:Header>
      <inb:FooRequestHeader>?</inb:FooRequestHeader>
   </soapenv:Header>
   <soapenv:Body>
      <inb:FooRequest/>
   </soapenv:Body>
</soapenv:Envelope>